////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) Microsoft Corporation.  All rights reserved.
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include "Graphics.h"

////////////////////////////////////////////////////////////////////////////////////////////////////

struct FONTFILEINFO {
    WORD dfVersion;                 // 0,1
    DWORD dfSize;                   // 2,3,4,5
    char dfCopyright[ 60 ];         // 6, ..., 65
    WORD dfType;                    // 66, 67
    WORD dfPoints;                  // 68, 69
    WORD dfVertRes;                 // 70, 71
    WORD dfHorizRes;                // 72, 73
    WORD dfAscent;                  // 74, 75
    WORD dfInternalLeading;         // 76, 77
    WORD dfExternalLeading;         // 78, 79
    BYTE dfItalic;                  // 80
    BYTE dfUnderline;               // 81
    BYTE dfStrikeOut;               // 82
    WORD dfWeight;                  // 83, 84
    BYTE dfCharSet;                 // 85
    WORD dfPixWidth;                // 86, 87
    WORD dfPixHeight;               // 88, 89
    BYTE dfPitchAndFamily;          // 90
    WORD dfAvgWidth;                // 91, 92
    WORD dfMaxWidth;                // 93, 94
    BYTE dfFirstChar;               // 95
    BYTE dfLastChar;                // 96
    BYTE dfDefaultChar;             // 97
    BYTE dfBreakChar;               // 98
    WORD dfWidthBytes;              // 99, 100
    DWORD dfDevice;                 // 101, 102, 103, 104
    DWORD dfFace;                   // 105, 106, 107, 108
    DWORD dfBitsPointer;            // 109, 110, 111, 112
    DWORD dfBitsOffset;             // 113, 114, 115, 116
    BYTE dfReserved;                // 117
    DWORD dfFlags;                // 118, 119, 120, 121
};

#define SIZEOF_FONTFILEINFO_2        118
#define SIZEOF_FONTFILEINFO_3       (SIZEOF_FONTFILEINFO_2 + 4 + 2 + 2 + 2 + 4 + 16)

struct GLYPHENTRY2 {
    union {
        DWORD Packed;
        struct {
            WORD geWidth;
            WORD geOffset;
        } u;
    };
};

struct GLYPHENTRY3 {
    BYTE geWidth[ 2 ];
    BYTE geOffset[ 4 ];
};

////////////////////////////////////////////////////////////////////////////////

#define NUMCHARS 96

struct  FONTINFO {
    LPCSTR szFilename;
    int nDescender;
    int nHeight;
    int nWidths[ NUMCHARS ];
};

typedef FONTINFO* PFONTINFO;

////////////////////////////////////////////////////////////////////////////////

static CLR_UINT16 ExtractUINT16( const void* data )
{
    const CLR_UINT8* ptr = (const CLR_UINT8*)data;

    return (ptr[ 1 ] << 8) | ptr[ 0 ];
}

static CLR_UINT32 ExtractUINT32( const void* data )
{
